/**
 * Created by Sam on 2016/12/28.
 * Copyright © 2016年 JX. All rights reserved.
 */

const GameUniqueId = {
    UNKNOWN_ID: 0,
    HF_BJPK10: "北京PK10",
    HF_CQSSC: "重庆时时彩",
    HF_XJSSC: "新疆时时彩",
    HF_TJSSC: "天津时时彩",
    HF_CQKL10F: "重庆快乐十分",
    HF_TJKL10F: "天津快乐十分",
    HF_GDKL10F: "广东快乐十分",
    HF_GDD11: "广东11选5",
    HF_AHD11: "安徽11选5",
    HF_JXD11: "江西11选5",
    HF_SDD11: "山东11选5",
    HF_SHD11: "上海11选5",
    X3D: "福彩3D",
    MARK_SIX: "六合彩",

    HF_HLJD11: "好运11选5",
    HF_CQD11: "重庆11选5",
    HF_ZJD11: "易乐11选5",
    HF_LND11: "辽宁11选5",
    HF_JXSSC: "江西时时彩",
    HF_KLPK: "快乐扑克",
    HF_KUAI3: "快3",
    HF_GXKUAI3: "新快3",
    HF_OLDKUAI3: "江苏快3",
    HF_NMGKUAI3: "易快3",
    HF_HBKUAI3: "湖北快3",
    HF_AHKUAI3: "好运快3",
    HF_KLC: "快乐彩",
    HF_KL8: "快乐8",
    HF_SHSSL: "上海时时乐",
    // 福彩、体彩
    SSQ: "双色球",
    QLC: "七乐彩",
    QXC: "七星彩",
    PL5: "排列五",
    DLT: "大乐透",
    PL3: "排列三",
    // 体育
    SP_JCZQ: "竞彩足球",
    SP_JCLQ: "竞彩篮球",
    SP_FOOTBALL_DCSPF: "足球单场",
    SP_FOOTBALL_SFC: "胜负彩",
    SP_FOOTBALL_9: "任选九场",
    SP_FOOTBALL_DCSFGG: "胜负过关",
    HF_LFSSC: "二分时时彩",
    HF_LFPK10: "二分PK拾",
    HF_LFD11: "二分11选5",
    HF_AHK3: "安徽快3",
    HF_GXK3: "广西快3",
    HF_JSK3: "江苏快3",
    HF_SG28: "新加坡28",
    HF_BJ28: "北京28",
}

const SSC_GameMathKey = {
    "五星-五星直选": "D5",
    "五星-五星通选": "C5",

    "三星-三星直选": "D3",
    "三星-三星组三": "C33",
    "三星-三星组六": "C36",

    "二星-二星直选": "D2",
    "二星-二星组选": "C2",
    "二星-二星组选和值": "CH2",

    "一星-一星直选": "D1",

    "定位胆-定位胆": "DN",

    "大小单双-后二大小单双": "DXDS",
    "大小单双-前二大小单双": "DXDS_Q2",
    "大小单双-前三大小单双": "DXDS_Q3",
    "大小单双-后三大小单双": "DXDS_H3",

    "不定位-前三一码": "BDW_Q31",
    "不定位-前三二码": "BDW_Q32",
    "不定位-后三一码": "BDW_H31",
    "不定位-后三二码": "BDW_H32",
    "不定位-前四一码": "BDW_Q41",
    "不定位-前四二码": "BDW_Q42",
    "不定位-后四一码": "BDW_H41",
    "不定位-后四二码": "BDW_H42",

    "不定位-五星一码": "BDW_Q51",
    "不定位-五星二码": "BDW_Q52",
    "不定位-五星三码": "BDW_Q53",

    "任选二-直选复式": "R2Z",
    "任选二-直选和值": "R2Z_HZ",
    "任选二-组选复式": "R2C",
    "任选二-组选和值": "R2C_HZ",

    "任选三-直选复式": "R3Z",
    "任选三-直选和值": "R3Z_HZ",
    "任选三-组三复式": "R3C3",
    "任选三-组六复式": "R3C6",
    "任选三-组选和值": "R3C_HZ",

    "任选四-直选复式": "R4Z",
    "任选四-组选24": "R4C24",
    "任选四-组选12": "R4C12",
    "任选四-组选6": "R4C6",
    "任选四-组选4": "R4C4",

    "龙虎-龙虎": "TND",
    "龙虎-龙虎-万千":"TND_54",
    '龙虎-龙虎-万百':"TND_53",
    '龙虎-龙虎-万十':"TND_52",
    '龙虎-龙虎-万个':"TND_51",
    '龙虎-龙虎-千百':"TND_43",
    '龙虎-龙虎-千十':"TND_42",
    '龙虎-龙虎-千个':"TND_41",
    '龙虎-龙虎-百十':"TND_32",
    '龙虎-龙虎-百个':"TND_31",
    '龙虎-龙虎-十个':"TND_21",

    "顺子-前三球": "POKER_Q3",
    "顺子-中三球": "POKER_Z3",
    "顺子-后三球": "POKER_H3",
    "大小单双-万位": "WW",
    "大小单双-千位": "QW",
    "大小单双-百位": "BW",
    "大小单双-十位": "SW",
    "大小单双-个位": "GW",
    "大小单双-总和": "SUM",
    "斗牛-斗牛": "DOUNIU",
}

const SSC_GameMathExplain = {
    "五星-五星通选": {
        explain: "以1元投注为单位，选5位号码，可中四种奖项（一等奖:20440，二等奖220,三等奖:40，四等奖：20）\n" +
            "一等奖：5位号码全中且顺序一致\n" +
            "二等奖：中前三或后三且顺序一致\n" +
            "三等奖：中前二与后二且顺序一致\n" +
            "四等奖：中前二或后二且顺序一致\n" +
            "派彩：（20440~20）*返奖级别/2000*金额\n",
        example: "示例：(投注2元,返奖级别:1960)\n" +
            "选号：1 2 5 8 0\n" +
            "开奖：1 2 5 8 0\n" +
            "派彩：20440*1960/2000*2=40062.4\n"
    },
    "五星-五星直选": {
        explain: "猜对全部5位号码，即万位、千位、百位、十位和个位，且顺序一致。\n",
        example: "示例：\n" +
            "选号：1 2 5 8 0\n" +
            "开奖：1 2 5 8 0 即中奖\n"
    },

    "三星-三星直选": {
        explain: "竟猜后三码，即(百、十、个)位，且顺序一致。\n",
        example: "示例：\n" +
            "选号：- - 5 8 0\n" +
            "开奖：1 2 5 8 0 即中奖\n"

    },
    "三星-三星组三": {
        explain: "后三码，即(百、十、个)位，顺序不限，且投注时三位号码有两位相同。 \n",
        example: "至少选择2个数字，对应多组选号；实选号码与开奖号后3位相同（顺序不限）才能中奖。\n" +
            "示例：\n" +
            "选号： 5 6\n" +
            "实选号码：5 5 6\n" +
            "                  5 6 6\n" +
            "开奖：1 2 5 5 6 即中奖\n"
    },
    "三星-三星组六": {
        explain: "后三码，即(百、十、个)位，顺序不限，且投注时三位号码各不相同。 \n",
        example: "至少选择3个数字；所选号码与开奖号后3位相同（顺序不限）才能中奖。示例：\n" +
            "选号： 5 8 0\n" +
            "开奖：1 2 5 8 0 即中奖 \n"
    },

    "二星-二星直选": {
        explain: "竟猜后两码，即十位和个位，且顺序一致。。 \n",
        example: "示例：\n" +
            "选号：* * *5 8 \n" +
            "开奖：1 2 3 5 8 即中奖\n"
    },
    "二星-二星组选": {
        explain: "从0－9十个数字中任选两个不同数字对“十位”和“个位”进行组选投注。 \n",
        example: "示例：\n" +
            "选号：* * * 58 \n" +
            "开奖：后二位85或58（顺序不限，不含对子号），即中奖 \n"
    },
    "二星-二星组选和值": "CH2",

    "一星-一星直选": "D1",

    "定位胆-定位胆": {
        explain: "在万位、千位、百位、十位、个位任意位置上任意选择1个或1个以上号码。 \n",
        example: "示例：\n" +
            "选号：万位：1 \n" +
            "开奖：1 2 3 5 8 即中定位胆万位\n"

    },

    "大小单双-后二大小单双": {
        explain: "大：数字5-9\n" +
            "小：数字0-4\n" +
            "单：数字13579\n" +
            "双：数字02468\n" +
            "从十、个位中的大小单双4种属性中各选1种属性，所选属性与开奖号码的属性相同即为中奖\n",
        example: "示例：\n" +
            "选号： 单 大 \n" +
            "开奖：十位：单，个位：大，即中奖 \n"
    },
    "大小单双-前二大小单双": {
        explain: "大：数字5-9\n" +
            "小：数字0-4\n" +
            "单：数字13579\n" +
            "双：数字02468\n" +
            "从万、千位中的大小单双4种属性中各选1种属性，所选属性与开奖号码的属性相同即为中奖\n",
        example: "示例：\n" +
            "选号：单 小 \n" +
            "开奖：万位：单，千位：小，即中奖 \n"

    },
    "大小单双-前三大小单双": {
        explain: "大：数字5-9\n" +
            "小：数字0-4\n" +
            "单：数字13579\n" +
            "双：数字02468\n" +
            "从万、千、百位中的大小单双4种属性中各选1种属性，所选属性与开奖号码的属性相同即为中奖\n",
        example: "示例：\n" +
            "选号：单 小 单 \n" +
            "开奖：万位：单，千位：小，百位：单，即中奖 \n"

    },
    "大小单双-后三大小单双": {
        explain: "大：数字5-9\n" +
            "小：数字0-4\n" +
            "单：数字13579\n" +
            "双：数字02468\n" +
            "从百、十、个位中的大小单双4种属性中各选1种属性，所选属性与开奖号码的属性相同即为中奖\n",
        example: "示例：\n" +
            "选号：单 单 大 \n" +
            "开奖：百位：单、十位：单、个位 ：大，即中奖 \n"

    },

    "不定位-前三一码": {
        explain: "选1个号码， 与开奖号码的前三位号码中其中一位相符。\n",
        example: "示例：\n" +
            "选号：1  \n" +
            "开奖：前三位置至少出现1个1 \n"

    },

    "不定位-前三二码": {
        explain: "选2个号码， 与开奖号码的前三位号码中其中两位相符。\n",
        example: "示例：\n" +
            "选号：12  \n" +
            "开奖：前三位置至少出现1个1和1个2 \n"

    },
    "不定位-后三一码": {
        explain: "选1个号码， 与开奖号码的后三位号码中其中一位相符。\n",
        example: "示例：\n" +
            "选号：1  \n" +
            "开奖：后三位置至少出现1个1 \n"

    },
    "不定位-后三二码": {
        explain: "选2个号码， 与开奖号码的后三位号码中其中两位相符。\n",
        example: "示例：\n" +
            "选号：12  \n" +
            "开奖：后三位置至少出现1个1和1个2  \n"
    },
    "不定位-前四一码": {
        explain: "选1个号码， 与开奖号码的前四位号码中其中一位相符。\n",
        example: "示例：\n" +
            "选号：1  \n" +
            "开奖：前四位置至少出现1个1 \n"

    },
    "不定位-前四二码": {
        explain: "选2个号码， 与开奖号码的前四位号码中其中两位相符。\n",
        example: "示例：\n" +
            "选号：1  \n" +
            "开奖：前四位置至少出现1个1，1个2\n"
    },
    "不定位-后四一码": {
        explain: "选1个号码， 与开奖号码的后四位号码中其中一位相符。\n",
        example: "示例：\n" +
            "选号：1  \n" +
            "开奖：后四位置至少出现1个1\n"
    },
    "不定位-后四二码": {
        explain: "选2个号码， 与开奖号码的后四位号码中其中两位相符。\n",
        example: "示例：\n" +
            "选号：1 2  \n" +
            "开奖：后四位置至少出现1个1，1个2\n"
    },

    "不定位-五星一码": {
        explain: "从0-9中任选一个数字进行投注，开奖号码中任意一位或一位以上的数字与所投注的数字相同，即为中奖。\n",
        example: "示例：\n" +
            "选号：1  \n" +
            "开奖：至少出现1个1\n"
    },
    "不定位-五星二码": {
        explain: "从0-9中任选二个数字进行投注，开奖号码中任意两位或两位以上的数字与所投注的数字相同。\n",
        example: "示例：\n" +
            "选号：1 2 \n" +
            "开奖：至少出现1和2各1个\n"
    },
    "不定位-五星三码": {
        explain: "从0-9中任选三个数字进行投注，开奖号码中任意三位或三位以上的数字与所投注的数字相同。\n",
        example: "示例：\n" +
            "选号：1 2 3\n" +
            "开奖：至少出现123各1个\n"
    },

    "任选二-直选复式": {
        explain: "从万位、千位、百位、十位、个位中至少两个位置上各选1个号码组成一注与开奖号码相符。\n",
        example: "示例：\n" +
            "选号：万位5、百位8\n" +
            "开奖：5 1 8 1 2\n"
    },
    "任选二-直选和值": {
        explain: "从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注与开奖号码的和值。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、百位，选择和值号码：13\n" +
            "开奖：5 1 8 1 2\n"
    },
    "任选二-组选复式": {
        explain: "从万位、千位、百位、十位、个位中至少选择两个位置，号码区至少选择两个号码构成一注。。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、百位，选择号码：8 5\n" +
            "开奖：5 1 8 1 2 或 8 1 5 1 2\n"
    },
    "任选二-组选和值": {
        explain: "从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注 。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、百位，选择和值号码：13\n" +
            "开奖：1 2 3 1 5\n"
    },

    "任选三-直选复式": {
        explain: "从万位、千位、百位、十位、个位中至少三个位置上各选1个号码组成一注。。\n",
        example: "示例：\n" +
            "选号：万位：5、百位：8、个位：2\n" +
            "开奖：5 1 8 1 2，即中奖 \n"
    },
    "任选三-直选和值": {
        explain: "选1个和值，猜中开奖号码个、十、百位号码的和值。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、百位、个位，选择和值号码：15\n" +
            "开奖：5 1 8 1 2，即中奖 \n"
    },
    "任选三-组三复式": {
        explain: "从万位、千位、百位、十位、个位中至少选择三个位置，号码区至少选择两个号码构成一注。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、十位、个位，选择号码：12\n" +
            "开奖：1 1 8 1 2 \n"
    },
    "任选三-组六复式": {
        explain: "从万位、千位、百位、十位、个位中至少选择三个位置，号码区至少选择三个号码构成一注。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、十位、个位，选择号码：512\n" +
            "开奖：5 1 8 1 2 \n"
    },
    "任选三-组选和值": {
        explain: "从万位、千位、百位、十位、个位中至少选择三个位置，至少选择一个和值号码构成一注。\n",
        example: "示例：\n" +
            "选号：位置选择：万位、十位、个位，选择和值号码：8\n" +
            "开奖：5 1 8 1 2 \n"
    },
    "任选四-直选复式": {
        explain: "从万位、千位、百位、十位、个位中至少四个位置上各选1个号码组成一注。\n",
        example: "示例：\n" +
            "选号：万位：5、千位：1、百位：8、十位：1\n" +
            "开奖：5 1 8 1 2，即中奖 \n"
    },
    "任选四-组选24": {
        explain: "从万位、千位、百位、十位、个位中至少选择四个位置，号码区至少选择四个号码构成一注。\n",
        example: "示例：\n" +
            "选号：位置选择：千位、百位、十位、个位，号码选择：0 5 6 8\n" +
            "开奖：1 0 5 6 8（指定位置号码顺序不限） \n"
    },
    "任选四-组选12": {
        explain: "从万位、千位、百位、十位、个位中至少选择四个位置，从“二重号”选择一个号码、“单号”选择两个号码组成一注。\n",
        example: "示例：\n" +
            "选号：位置选择：千位、百位、十位、个位，二重号：8、单号：06\n" +
            "开奖：1 0 6 8 8（指定位置号码顺序不限） \n"
    },
    "任选四-组选6": {
        explain: "从万位、千位、百位、十位、个位中至少选择四个位置，从“二重号”选择两个号码组成一注。\n",
        example: "示例：\n" +
            "选号：选择位置：千位、百位、十位、个位，二重号：2、8\n" +
            "开奖：1 2 2 8 8（指定位置号码顺序不限） \n"
    },
    "任选四-组选4": {
        explain: "从万位、千位、百位、十位、个位中至少选择四个位置，从“三重号”选择一个号码、“单号”选择一个号码组成一注。\n",
        example: "示例：\n" +
            "选号：位置选择：千位、百位、十位、个位，三重号：8、单号：2\n" +
            "开奖：1 8 8 2 8（指定位置号码顺序不限） \n"
    },
}

const BJPK10_GameMathKey = {
    "前一": "D1",
    "前二": "GT2",
    "前三": "GT3",
    "定位胆": "DN",
    "第一名":"DYM",
    "第二名":"DEM",
    "第三名":"DSM",
    "冠亚和值":"GYHZ",
    "冠亚和":"GYH"

}

const BJPK10_GameMathExplain = {
    "前一": {
        explain: "选号与开奖号按位猜中1位即中奖。\n",
        example: "示例：\n" +
            "选号：01\n" +
            "开奖：01 * * * * * * \n"
    },
    "前二": {
        explain: "选号与开奖号按位猜中2位即中奖。\n",
        example: "示例：\n" +
            "选号：01 02\n" +
            "开奖：01 02 * * * * * * \n"
    },
    "前三": {
        explain: "选号与开奖号按位猜中3位即中奖。\n",
        example: "示例：\n" +
            "选号：01 02 03\n" +
            "开奖：01 02 03 * * * * * * \n"
    },
    "定位胆": {
        explain: "选号与开奖号按位猜中1位或1位以上即中奖 。\n",
        example: "示例：\n" +
            "选号：冠军：05\n" +
            "开奖：05 * * ** * * * * * \n"
    },
}

const HappyPoker_GameMathKey = {
    "包选": "BX",
    "同花单选": "THDX",
    "顺子单选": "SZDX",
    "同花顺单选": "THSDX",
    "豹子单选": "BZDX",
    "对子单选": "DZDX",
    "任选一": "R1",
    "任选二": "R2",
    "任选三": "R3",
    "任选四": "R4",
    "任选五": "R5",
    "任选六": "R6"
}

const XYFT_GameMathKey = {
    "前一": "D1",
    "前二": "GT2",
    "前三": "GT3",
    "定位胆": "DN",
    "第一名":"D1M",
    "第二名":"D2M",
    "第三名":"D3M",
    "第四名":"D4M",
    "第五名":"D5M",
    "第六名":"D6M",
    "第七名":"D7M",
    "第八名":"D8M",
    "第九名":"D9M",
    "第十名":"D10M",
    "冠亚和值":"GYHZ",
    "冠亚和":"GYH",
}

const HappyPoker_GameMathExplain = {
    "包选": {
        explain: "同花：开奖的3个号码花色相同。\n" +
            "顺子：开奖的3个号码是三连号。\n" +
            "同花顺：开奖的3个号码是三连号且花色相同。\n" +
            "豹子：开奖的3个号码均相同。\n" +
            "对子：开奖的3个号码中有且只有2个号码相同。\n" +
            "在同花、顺子、同花顺、豹子、对子中至少选择一个。\n",
        example: "示例：\n" +
            "选号：顺子\n" +
            "开奖：A 2 3 \n" +
            "最高中奖：2*赔率\n"
    },
    "同花单选": {
        explain: "同花：开奖的3个号码花色相同。\n" +
            "在黑桃、红桃、梅花、方块四种花色中至少选择一种。\n",
        example: "示例：\n" +
            "选号：黑桃\n" +
            "开奖：黑桃：A 黑桃：2 黑桃：4 \n" +
            "最高中奖：2*赔率\n"
    },
    "顺子单选": {
        explain: "顺子：开奖的3个号码是三连号。\n" +
            "在所有顺子中至少选择一个顺子。\n",
        example: "示例：\n" +
            "选号：A 2 3\n" +
            "开奖：A 2 3 \n" +
            "最高中奖：2*赔率\n"
    },
    "同花顺单选": {
        explain: "同花顺：开奖的3个号码是三连号且花色相同。\n" +
            "在黑桃、红桃、梅花、方块四种花色中至少选择一种。\n",
        example: "示例：\n" +
            "选号：黑桃顺子\n" +
            "开奖：黑桃：A 黑桃：2 黑桃：3\n" +
            "最高中奖：2*赔率\n"
    },
    "豹子单选": {
        explain: "豹子：开奖的3个号码均相同。\n" +
            "在所有豹子中至少选择一个。\n",
        example: "示例：\n" +
            "选号：A A A\n" +
            "开奖：A A A \n" +
            "最高中奖：2*赔率\n"
    },
    "对子单选": {
        explain: "对子：开奖的3个号码中有且只有2个号码相同。\n" +
            "在所有对子中至少选择一个。\n",
        example: "示例：\n" +
            "选号：A A\n" +
            "开奖：A A 3 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选一": {
        explain: "从A~K中任选1个号码投注且与开奖号码中的任意1个相同（不分花色）。\n",
        example: "示例：\n" +
            "选号：A\n" +
            "开奖：A A 3 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选二": {
        explain: "	从A~K中任选2个号码投注且与开奖号码中的任意2个相同（不分花色）。\n",
        example: "示例：\n" +
            "选号：A 2\n" +
            "开奖：A 2 3 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选三": {
        explain: "从A~K中任选3个号码投注，投注号码包含开奖号码（不分花色）。\n",
        example: "示例：\n" +
            "选号：A 2 3\n" +
            "开奖：A A 2、3 3 3 等\n" +
            "最高中奖：2*赔率\n"
    },
    "任选四": {
        explain: "从A~K中任选4个号码投注，投注号码包含开奖号码（不分花色）。\n",
        example: "示例：\n" +
            "选号：A 2 3 4\n" +
            "开奖：A A 2、3 3 3 等\n" +
            "最高中奖：2*赔率\n"
    },
    "任选五": {
        explain: "从A~K中任选5个号码投注，投注号码包含开奖号码（不分花色）。\n",
        example: "示例：\n" +
            "选号：A 2 3 4 5\n" +
            "开奖：A A 2、3 3 3 等\n" +
            "最高中奖：2*赔率\n"
    },
    "任选六": {
        explain: "从A~K中任选6个号码投注，投注号码包含开奖号码（不分花色）。\n",
        example: "示例：\n" +
            "选号：A 2 3 4 5 6\n" +
            "开奖：A A 2、3 3 3 等\n" +
            "最高中奖：2*赔率\n"
    },
}

const D11X5_GameMathKey = {
    "任选二": "R2",
    "任选二胆拖": "R2DT",
    "任选三": "R3",
    "任选三胆拖": "R3DT",
    "任选四": "R4",
    "任选四胆拖": "R4DT",
    "任选五": "R5",
    "任选五胆拖": "R5DT",
    "任选六": "R6",
    "任选六胆拖": "R6DT",
    "任选七": "R7",
    "任选七胆拖": "R7DT",
    "任选八": "R8",
    "任选八胆拖": "R8DT",
    "前一直选": "Q1Z",
    "前二组选": "Q2C",
    "前二组选胆拖": "Q2CDT",
    "前二直选": "Q2Z",
    "前三组选": "Q3C",
    "前三组选胆拖": "Q3CDT",
    "前三直选": "Q3Z",
}


const D11X5_GameMathExplain = {
    "任选二": {
        explain: "选择2个或2个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：05 04\n" +
            "开奖：08 04 11 05 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选二胆拖": {
        explain: "选择2个或2个以上的号码进行投注，每注需至少包括1个胆码及1个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：06\n" +
            "开奖：08 04 11 06 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选三": {
        explain: "选择3个或3个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：05 04 11\n" +
            "开奖：08 04 11 05 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选三胆拖": {
        explain: "选择3个或3个以上的号码进行投注，每注需至少包括1个胆码及2个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：06 11\n" +
            "开奖：08 04 11 06 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选四": {
        explain: "选择4个或4个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：08 04 11 06\n" +
            "开奖：08 04 11 06 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选四胆拖": {
        explain: "选择4个或4个以上的号码进行投注，每注需至少包括1个胆码及3个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：06 03 04\n" +
            "开奖：08 04 11 06 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选五": {
        explain: "选择5个或5个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：08 04 11 06 03\n" +
            "开奖：08 04 11 06 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选五胆拖": {
        explain: "选择5个或5个以上的号码进行投注，每注需至少包括1个胆码及4个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：04 11 06 03\n" +
            "开奖：08 04 11 06 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选六": {
        explain: "选择6个或6个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：05 10 04 11 03 08\n" +
            "开奖：08 04 11 05 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选六胆拖": {
        explain: "选择6个或6个以上的号码进行投注，每注需至少包括1个胆码及5个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：02 05 06 09 11\n" +
            "开奖：06 08 11 09 02 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选七": {
        explain: "选择7个或7个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：05 10 04 11 03 08 09\n" +
            "开奖：08 04 11 05 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选七胆拖": {
        explain: "选择7个或7个以上的号码进行投注，每注需至少包括1个胆码及6个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：01 02 05 06 09 11\n" +
            "开奖：06 08 11 09 02 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选八": {
        explain: "选择8个或8个以上号码与开奖任意号码相同。\n",
        example: "示例：\n" +
            "选号：05 10 04 11 03 08 09 01\n" +
            "开奖：08 04 11 05 03 \n" +
            "最高中奖：2*赔率\n"
    },
    "任选八胆拖": {
        explain: "选择8个或8个以上的号码进行投注，每注需至少包括1个胆码及7个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：01 02 03 05 06 09 11\n" +
            "开奖：06 08 11 09 02 \n" +
            "最高中奖：2*赔率\n"
    },
    "前一直选": {
        explain: "选择1个或1个以上号码与开奖第1个号码相同。\n",
        example: "示例：\n" +
            "选号：01\n" +
            "开奖：01 * * * * \n" +
            "最高中奖：2*赔率\n"
    },
    "前二组选": {
        explain: "选择2个或2个以上号码与开奖前两个号码相同且顺序一致。\n",
        example: "示例：\n" +
            "选号：01 02\n" +
            "开奖：02 01 ***（前二顺序不限） \n" +
            "最高中奖：2*赔率\n"
    },
    "前二组选胆拖": {
        explain: "选择2个或2个以上的号码进行投注，每注需至少包括1个胆码及1个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：06\n" +
            "开奖：08 06 * * *（前二顺序不限） \n" +
            "最高中奖：2*赔率\n"
    },
    "前二直选": {
        explain: "选择2个或2个以上号码与开奖前两个号码相同且顺序一致。\n",
        example: "示例：\n" +
            "选号：第一位：01，第二位：02\n" +
            "开奖： 01 02 * * * \n" +
            "最高中奖：2*赔率\n"
    },
    "前三组选": {
        explain: "选择3个或3个以上号码与开奖前三个号码相同。\n",
        example: "示例：\n" +
            "选号：01、02、03\n" +
            "开奖：03 01 02 * *（前三顺序不限） \n" +
            "最高中奖：2*赔率\n"
    },
    "前三组选胆拖": {
        explain: "选择3个或3个以上的号码进行投注，每注需至少包括1个胆码及2个拖码。\n",
        example: "示例：\n" +
            "选号：胆码：08、拖码：06 11\n" +
            "开奖：08 04 11 * * *（前三顺序不限） \n" +
            "最高中奖：2*赔率\n"
    },
    "前三直选": {
        explain: "选择3个或3个以上号码与开奖前两个号码相同且顺序一致。\n",
        example: "示例：\n" +
            "选号：01、02、03\n" +
            "开奖：01 02 03 * * \n" +
            "最高中奖：2*赔率\n"
    },
}


const MarkSix_GameMathKey = {
    "特码A-选码": "SA",
    "特码B-选码": "SB",
    "两面-两面": "BS",
    "色波-色波": "C",
    "色波-半波": "C",
    "色波-半半波": "C",

    "特肖-生肖": "SX",
    "合肖-合肖": "GRPX",
    "头尾数-头尾数": "SHT",

    "正码-选码": "NG",
    "正码-其它": "NG",

    "正码特-正一特": "NGB1",
    "正码特-正二特": "NGB2",
    "正码特-正三特": "NGB3",
    "正码特-正四特": "NGB4",
    "正码特-正五特": "NGB5",
    "正码特-正六特": "NGB6",

    "正码1-6-正码一": "NG1261",
    "正码1-6-正码二": "NG1262",
    "正码1-6-正码三": "NG1263",
    "正码1-6-正码四": "NG1264",
    "正码1-6-正码五": "NG1265",
    "正码1-6-正码六": "NG1266",

    "五行-种类": "FX",
    "平特一肖尾数-一肖": "GSX",
    "平特一肖尾数-尾数": "GST",

    "正肖-生肖": "GX",
    "7色波-种类": "SC",
    "总肖-种类": "XC",

    "自选不中-自选不中": "NB",

    "连肖连尾-二连肖": "XB2",
    "连肖连尾-三连肖": "XB3",
    "连肖连尾-四连肖": "XB4",
    "连肖连尾-五连肖": "XB5",
    "连肖连尾-二连尾": "TB2",
    "连肖连尾-三连尾": "TB3",
    "连肖连尾-四连尾": "TB4",
    "连肖连尾-五连尾": "TB5",

    "连码-三中二": "LM3Z2",
    "连码-三全中": "LM3QZ",
    "连码-二全中": "LM2QZ",
    "连码-二中特": "LM2ZT",
    "连码-特串": "LMTC",
    "连码-四全中": "LM4QZ",
}


/**
 * 六合彩玩法说明
 */
const MarkSix_GameMathExplain = {
    "特码A": {
        explain: "投注号码为开奖号码之特别号，视为中奖，其余情形视为不中奖。",
        example: null
    },
    "特码B": {
        explain: "投注号码为开奖号码之特别号，视为中奖，其余情形视为不中奖。",
        example: null
    },
    "特码-种类": {
        explain: "特大：开出的特码，大于或等于25 (25~48)。 若特码为49，为和局。\n" +
            "特小：开出的特码，小于或等于24（01~24）。若特码为49，为和局。\n" +
            "特尾大：5尾~9尾为大，如：05、18、19。49为和局。\n" +
            "特尾小：0尾~4尾为小，如：01、32、44。49为和局。\n" +
            "特单：特码为单数。49为和局。\n" +
            "特双：特码为双数。49为和局。\n" +
            "特大单：特码大于或等于25(25~48) ，且为单数。49为和局。\n" +
            "特大双：特码大于或等于25 (25~48)，且为双数。49为和局。\n" +
            "特合大：特码个位和十位数字总和大于或等于7。49为和局。\n" +
            "特合小：特码个位和十位数字总和小于或等于6，49为和局。。\n" +
            "特小单：开出的特码，(01~24)小于或等于24并为单数。49为和局。\n" +
            "特小双：开出的特码，(01~24)小于或等于24并为双数。49为和局。\n" +
            "特合单：特码个位和十位数字总和为单。49为和局。\n" +
            "特合双：特码个位和十位数字总和为双。49为和局。\n" +
            "特天肖：特码为：兔马猴猪牛龙。\n" +
            "特地肖：特码为：鼠虎蛇羊鸡狗。\n" +
            "特前肖：特码为：鼠牛虎兔龙蛇。\n" +
            "特后肖：特码为：马羊猴鸡狗猪。\n" +
            "特家肖：特码为：羊马牛猪狗鸡。\n" +
            "特野肖：特码为：猴蛇龙兔虎鼠。\n" +
            "总大：所有七个开奖号码的分数总和大于或等于175。\n" +
            "总小：所有七个开奖号码的分数总和大小或等于174。\n" +
            "总单：所有七个开奖号码的分数总和是单数。\n" +
            "总双：所有七个开奖号码的分数总和是双数。\n",
        example: null
    },
    "特码-色波": {
        explain: "以特码的球色下注，开奖的球色与下注的颜色相同，视为中奖.\n" +
            "红波：投注红色球，开奖的球色为红色，视为中奖。\n" +
            "蓝波：投注蓝色球，开奖的球色为蓝色，视为中奖。\n" +
            "绿波：投注绿色球，开奖的球色为绿色，视为中奖。\n",
        example: null
    },
    "色波-半波": {
        explain: "以特码色波和特码单双大小为一个投注组合。当开出的特码出现在其投注组合中，即视为中奖（其余情况则视为不中奖）。" +
            "若开出特码为49号时，所有投注半波任意一个组合接会被视为和局，并返回全部本金（不派发返点）。\n" +
            "红单：特码为红色且为单数。\n" +
            "红双：特码为红色且为双数。\n" +
            "红大：特码为红色且大于或等于25(25~48)。\n" +
            "红小：特码为红色且小于或等于24 (01~24)。\n" +
            "蓝单：特码为蓝色且为单数。\n" +
            "蓝双：特码为蓝色且为双数。\n" +
            "蓝大：特码为蓝色且大于或等于25(25~48)。\n" +
            "蓝小：特码为蓝色且小于或等于24 (01~24)。\n" +
            "绿单：特码为绿色且为单数。\n" +
            "绿双：特码为绿色且为双数。\n" +
            "绿大：特码为绿色且大于或等于25(25~48)。\n" +
            "绿小：特码为绿色且小于或等于24 (01~24)\n",
        example: null
    },
    "色波-半半波": {
        explain: "以特码色波和特码单双及特码大小等三种游戏为一个投注组合，当期特码开出符合投注组合，即视为中奖； " +
            "若当期特码开出49号，则视为和局；其余情形视为不中奖。\n" +
            "红大单：特码为红色且大于或等于25(25~48) 并为单数。\n" +
            "红大双：特码为红色且大于或等于25(25~48) 并为双数。\n" +
            "红小单：特码为红色且小于或等于24 (01~24) 并为单数。\n" +
            "红小双：特码为红色且小于或等于24 (01~24) 并为双数。\n" +
            "蓝大单：特码为蓝色且大于或等于25(25~48) 并为单数。\n" +
            "蓝大双：特码为蓝色且大于或等于25(25~48) 并为双数。\n" +
            "蓝小单：特码为蓝色且小于或等于24 (01~24) 并为单数。\n" +
            "蓝小双：特码为蓝色且小于或等于24 (01~24) 并为双数。\n" +
            "绿大单：特码为绿色且大于或等于25(25~48) 并为单数。\n" +
            "绿大双：特码为绿色且大于或等于25(25~48) 并为双数。\n" +
            "绿小单：特码为绿色且小于或等于24 (01~24) 并为单数。\n" +
            "绿小双：特码为绿色且小于或等于24 (01~24) 并为双数。\n",

        example: null
    },
    "特肖-生肖": {
        explain: "生肖顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪 。" +
            "如今年是鸡年，就以鸡为开始，依顺序将49个号码分为12个生肖。如下：\n" +
            "鼠	10,22,34,46\n" +
            "牛	09,21,33,45\n" +
            "虎	08,20,32,44\n" +
            "兔	07,19,31,43\n" +
            "龙	06,18,30,42\n" +
            "蛇	05,17,29,41\n" +
            "马	04,16,28,40\n",
        example: null
    },
    "头尾数": {
        explain: "特码所属头数或尾数的号码（开奖结果特别号码是21则 \"2\"头为中奖，其他头数都不中奖）。\n" +
            "0头：	01，02，03，04，05，06，07，08，09。\n" +
            "1头	：10，11，12，13，14，15，16，17，18，19。\n" +
            "2头	：	20，21，22，23，24，25，26，27，28，29。\n" +
            "3头	：30，31，32，33，34，35，36，37，38，39。\n" +
            "4头	：40，41，42，43，44，45，46，47，48，49。\n" +
            "0尾	：10，20，30，40。\n" +
            "1尾	：01，11，21，31，41。\n" +
            "2尾	：02，12，22，32，42。\n" +
            "3尾	：03，13，23，33，43。\n" +
            "4尾	：04，14，24，34，44。\n" +
            "5尾	：05，15，25，35，45。\n" +
            "6尾	：06，16，26，36，46。\n" +
            "7尾	：07，17，27，37，47。\n" +
            "8尾	：08，18，28，38，48。\n" +
            "9尾	：09，19，29，39，49\n",
        example: null
    },
    "正码-选号": {
        explain: "每期开出的前面六个号码为正码，下注号码如在六个正码号码里中奖。\n",
        example: null
    },
    "正码-种类": "NG",
    "五行": {
        explain: "五行挑选一个五行选项为一个组合，若开奖号码的特码在此组合内，即视为中奖；" +
            "若开奖号码的特码不在此组合内，即视为不中奖。、\n" +
            "金	：01，06，11，16，21，26，31，36，41，46。\n" +
            "木：02，07，12，17，22，27，32，37，42，47。\n" +
            "水：03，08，13，18，23，28，33，38，43，48。\n" +
            "火：04，09，14，19，24，29，34，39，44，49。\n" +
            "土：05，10，15，20，25，30，35，40，45。\n",
        example: null
    },
    "平特一肖": {
        explain: "当期开奖的全部号码(前6个号码和特码)，其中只要有一个球号在投注的生肖范围则中奖；" +
            "没有一个球号在投注的生肖范围内，则不中奖；多个球号在投注生肖范围内，则中奖；" +
            "但奖金不倍增，派彩只派一次，即不论同生肖号码出现一个或多个号码都只派一次。\n",
        example: null
    },
    "平特尾数": {
        explain: "只要当期号码(所有正码及开出来的特码)，含所属尾数的一个或多个号码，" +
            "但派彩只派一次，即不论同尾数号码出现一个或多个号码都只派彩一次。\n" +
            "\"1\"尾：01，11，21，31，41。\n" +
            "\"2\"尾：02，12，22，32，42。\n" +
            "\"3\"尾：03，13，23，33，43。\n" +
            "\"4\"尾：04，14，24，34，44。\n" +
            "\"5\"尾：05，15，25，35，45。\n" +
            "\"6\"尾：06，16，26，36，46。\n" +
            "\"7\"尾：07，17，27，37，47。\n" +
            "\"8\"尾：08，18，28，38，48。\n" +
            "\"9\"尾：09，19，29，39，49。\n" +
            "\"0\"尾：10，20，30，40。\n",
        example: null
    },
    "正肖-生肖": {
        explain: "当期开奖的前6个号码(不含特码，不分先后顺序)，其中有一个球号在投注的生肖范围即算中奖。" +
            "如果有多个球号开在投注生肖范围内，派彩金额将自动倍增。\n",
        example: null
    },
    "7色波-种类": {
        explain: "以开出的7个色波，那种颜色最多为中奖。 开出的6个正码各以1个色波计，特别号以1.5个色波计。而以下3种结果视为和局。\n" +
            "6个正码开出3蓝3绿，而特别码是1.5红。\n" +
            "6个正码开出3蓝3红，而特别码是1.5绿。\n" +
            "6个正码开出3绿3红，而特别码是1.5蓝。\n" +
            "如果出现和局，所有投注红，绿，蓝七色波的金额将全数退回，会员也可投注和局。\n",
        example: null
    },
    "总肖-种类": {
        explain: "所有正码与特码开出的不同生肖总数，与所投注之预计开出之生肖总数和，则视为中奖。\n",
        example: "例如：如果'当期号码为19、24、12、34、40、39 特码：49，总计六个生肖，若选总肖【6】则为中奖。(请注意：49号亦算输赢，不为和)"

    },
    "合肖": "GRPX",
    "正码特": "numGeneralBingo",
    "正码1-6": "	numGeneral126",
    "自选不中	": "noneBingo",
    "二连肖": "	twoXiaosBingo",
    "三连肖	": "threeXiaosBingo",
    "四连肖": "	fourXiaosBingo",
    "五连肖	": "fiveXiaosBingo",
    "二连尾": "	twoTailsBingo",
    "三连尾": "threeTailsBingo",
    "四连尾": "fourTailsBingo",
    "五连尾": "fiveTailsBingo",
    "连码": "lianMa",
}
const D3_GameMathKey = {
    "3D直选": "NIO3",
    "3D组三单式": "GRP3",
    "3D组三复式": "GRP3",
    "3D组六": "GRP6",
}

const KL10F_GameMathKey = {
    "首位数投": "ST1",
    "首位红投": "RT1",
    "二连直": "DC2",
    "二连组": "CC2",
    "前三直": "DT3",
    "前三组": "CT3",
    "快乐二": "KL2",
    "快乐三": "KL3",
    "快乐四": "KL4",
    "快乐五": "KL5",
}

const KL10F_GameMathExplain = {
    "首位数投": {
        explain: "从01至18中任意选择一个数字号码，与开奖出现的第一个位置的号码相符。\n",
        example: null
    },
    "首位红投": {
        explain: "从19和20中任意选择一个红色号码，与开奖中按开奖顺序出现的第一个位置为红色号码相符。\n",
        example: null
    },
    "二连直": {
        explain: "20个号码中任选连续两位,投注号码与开奖号码任意连续两位数字、顺序均相同 。",
        example: null
    },
    "二连组": {
        explain: "20个号码中任选2个,投注号与开奖号任意连续两位数字相同(顺序不限)即中。",
        example: null
    },
    "前三直": {
        explain: "20个号码中猜开奖号码前三位,投注号码与开奖号码前三位数字、顺序均相同。",
        example: null
    },
    "前三组": {
        explain: "20个号码中猜开奖号码的前三位,投注号与开奖号前三位数字相同(顺序不限)即中。",
        example: null
    },
    "快乐二": {
        explain: "20个号码中任选2个,投注号码与开奖号码任意两位相同。",
        example: null
    },
    "快乐三": {
        explain: "20个号码中任选3个,投注号码与开奖号码任意三位相同。",
        example: null
    },
    "快乐四": {
        explain: "20个号码中任选4个,投注号码与开奖号码任意四位相同。",
        example: null
    },
    "快乐五": {
        explain: "20个号码中任选5个,投注号码与开奖号码任意五位相同。",
        example: null
    },
}

const PL3_SSL_GameMathKey = {
    "三星-直选复式": "NIO3",
    "三星-直选和值": "NS3",
    "三星-组三复式": "GRP3",
    "三星-组六复式": "GRP6",
    "三星-组三和值": "G3S",
    "三星-组六和值": "G6S",
    "二星-前二直选": "F2IO",
    "二星-后二直选": "L2IO",
    "二星-前二组选": "F2",
    "二星-后二组选": "L2",
    "定位胆-定位胆": "SP",
    "不定位-一码不定位": "NS1P",
    "不定位-二码不定位": "NS2P",
    "大小单双-前二大小单双": "F2BSOE",
    "大小单双-后二大小单双": "L2BSOE"
}

const PL3_SSL_GameMathExplain = {
    "三星-直选复式": {
        explain: "从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码后3位相同，顺序一致。\n",
        example: "示例：\n" +
            "选号：3 4 5\n" +
            "开奖：3 4 5 \n"
    },
    "三星-直选和值": {
        explain: "所选数值等于开奖号码的百位、十位、个位三个数字相加之和。\n",
        example: "示例：\n" +
            "选号：和值：1\n" +
            "开奖： 0 0 1、0 1 0、1 0 0\n"
    },
    "三星-组三复式": {
        explain: "从0-9中选择2个数字组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限。\n",
        example: "示例：\n" +
            "选号：5 8 8\n" +
            "开奖：5 8 8 （顺序不限）\n"
    },
    "三星-组六复式": {
        explain: "从0-9任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位，顺序不限。\n",
        example: "示例：\n" +
            "选号：2 5 8\n" +
            "开奖：8 5 2（顺序不限） \n"
    },
    "三星-组三和值": {
        explain: "所选数值等于开奖号码三个数相加之和且出现对子。\n",
        example: "示例：\n" +
            "选号：和值：3\n" +
            "开奖：0 0 3（顺序不限） \n"
    },
    "三星-组六和值": {
        explain: "所选数值等于开奖号码三个数相加之和不出现对子。\n",
        example: "示例：\n" +
            "选号：和值：3\n" +
            "开奖：0 1 2（顺序不限） \n"
    },
    "二星-前二直选": {
        explain: "从百位、十位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致。\n",
        example: "示例：\n" +
            "选号：5 8\n" +
            "开奖：前二位为5 8\n"
    },
    "二星-后二直选": {
        explain: "从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的后2位相同，且顺序一致。\n",
        example: "示例：\n" +
            "选号：5 8\n" +
            "开奖：后二位为5 8 \n"
    },
    "二星-前二组选": {
        explain: "从0-9中选择2个数字组成一注，所选号码与开奖号码的百位、十位相同，且顺序不限。\n",
        example: "示例：\n" +
            "选号：5 8\n" +
            "开奖：前二位为8 5或5 8（顺序不限，不含对子号）\n"
    },
    "二星-后二组选": {
        explain: "从0-9中选择2个号码组成一注，所选号码与开奖号码的十位、个位相同（不含对子号），顺序不限。\n",
        example: "示例：\n" +
            "选号：5 8\n" +
            "开奖：后二位为8 5或5 8（顺序不限，不含对子号） \n"
    },
    "定位胆-定位胆": {
        explain: "从百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致。\n",
        example: "示例：\n" +
            "选号：百位：1\n" +
            "开奖：百位：1 \n"
    },
    "不定位-一码不定位": {
        explain: "从0-9中选择1个号码组成一注，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选的号码。\n",
        example: "示例：\n" +
            "选号：1\n" +
            "开奖：至少出现1个1 \n"
    },
    "不定位-二码不定位": {
        explain: "从0-9中选择2个号码组成一注，每注由2个不同的号码组成，只要开奖号码的百位、十位、个位中包含所选的2个号码。\n",
        example: "示例：\n" +
            "选号：1 3\n" +
            "开奖：至少出现1和2各1个 \n"
    },
    "大小单双-前二大小单双": {
        explain: "对百位和十位的\"大（56789）小（01234）单（13579）双（02468）\"形态进行购买，所选号码的位置、形态与开奖位置相同。\n",
        example: "示例：\n" +
            "选号：小 双\n" +
            "开奖：百位：小 十位：双 \n"
    },
    "大小单双-后二大小单双": {
        explain: "对十位和个位的\"大（56789）小（01234）单（13579）双（02468）\"形态进行购买，所选号码的位置、形态与开奖位置相同。\n",
        example: "示例：\n" +
            "选号：大 单\n" +
            "开奖：百位：小，十位：双 \n"
    },
}

const PCDD_GameMathKey = {
    "混合": "MIX",
    "波色": "BS",
    "豹子": "BZ",
    "特码包三": "SP3",
    "特码": "SP",
}

const PCDD_GameMathExplain = {
    "混合": {
        explain: "组合形态：大双 大单 小双 小单。\n" +
            "大：数字14-27。\n" +
            "小：数字0-13。\n" +
            "单：数字为1~27的单数。\n" +
            "双：数字为0~26的双数 。\n" +
            "大单：数字为15~27的单数。\n" +
            "大双：数字为14~26的双数。\n" +
            "小单：数字为1~13的单数。\n" +
            "小双：数字0~12的双数。\n" +
            "极大：22-27为极大。\n" +
            "极小：0-5为极小。\n",
        example: null

    },
    "波色": {
        explain: "当期开奖号码和值，符合投注组合，即中奖。\n" +
            "绿波：1,4,7,10,16,19,22,25。\n" +
            "蓝波：2,5,8,11,17,20,23,26。\n" +
            "红波：3,6,9,12,15,18,21,24。\n",
        example: null
    },
    "豹子": {
        explain: "当期3个开奖号码一致则中奖。\n",
        example: "示例：\n" +
            "选号：投豹子\n" +
            "开奖：3+3+3=9\n "
    },
    "特码包三": {
        explain: "从0-27中任选3个号码组成1注，任意一个选号与开奖号码和值相同，即中奖 。\n",
        example: null
    },
    "特码": {
        explain: "从0-27中选取一个以上的数字，投注号码与开奖号码和值相同，即中奖。\n",
        example: null
    },
}


const K3_GameMathKey = {
    "和值": "HZ",
    "三同号通选": "STHTX",
    "三同号单选": "STHDX",
    "三不同号": "SBTH",
    "三连号通选": "SLHTX",
    "二同号复选": "ETHFX",
    "二同号单选": "ETHDX",
    "二不同号": "EBTH",
    "和值大小单双": "DXDS",
    "二不同号胆拖": "EBTHDT",
    "猜一个号": "CYG",
}

const K3_GameMathExplain = {
    "和值": {
        explain: "从3-18中任意选择1个或1个以上号码，所选数值等于开奖号码三个数字相加之和 。\n",
        example: "示例：\n" +
            "选号：和值：4 \n" +
            "开奖：1+ 1+ 2 = 4 \n"
    },
    "三同号通选": {
        explain: "对所有三同号（111,222,333,444,555,666）进行投注，开奖结果为任意数字的三重号。\n",
        example: "示例：\n" +
            "选号：通选\n" +
            "开奖：222或其他三重号数字 \n"
    },
    "三同号单选": {
        explain: "选择任意一组或一组以上三位相同的号码。\n",
        example: "示例：\n" +
            "选号：2 2 2 \n" +
            "开奖：2 2 2  即为中奖\n"
    },
    "三不同号": {
        explain: "选择任意三个或以上的号码进行投注。\n",
        example: "示例：\n" +
            "选号：2 5 6 \n" +
            "开奖：2 5 6 （顺序不限）  即为中奖\n"
    },
    "三连号通选": {
        explain: "任意三个相连的号码与开奖结果相同（顺序不限）。\n",
        example: "示例：\n" +
            "选号：三连号通选 \n" +
            "开奖：1 2 3，3 2 4，3 4 5，4 5 6 即为中奖\n"
    },
    "二同号复选": {
        explain: "至少选1个对子投注，开奖号包含此对子即中奖。\n",
        example: "示例：\n" +
            "选号：1 1 * \n" +
            "开奖：1 1 2 即为中奖\n"
    },
    "二同号单选": {
        explain: "至少选1个对子和1个不同号投注，与开奖号码全相同即中奖。\n",
        example: "示例：\n" +
            "选号：1 1 2 \n" +
            "开奖：1 1 2 即为中奖\n"
    },
    "二不同号": {
        explain: "至少选择2个号码，与开奖的任意2个号码相同即中奖。\n",
        example: "示例：\n" +
            "选号：2，5 \n" +
            "开奖：2  *  5、2  5  *  即为中奖 \n"
    },
    "二不同号胆拖": {
        explain: "选1个胆码，选1～5个拖码，胆码加拖码不少于2个，选号与奖号任意2号相同即中奖。\n",
        example: "示例：\n" +
            "选号：胆码：2，拖码：5，或胆码：5，拖码：2 \n" +
            "开奖：2 * 5、2 5 * 即为中奖  \n"
    },
    "猜一个号": {
        explain: "选择1个您认为一定会开出的号码，系统将智能为您筛选出包含该号码的单选号码组合。\n",
        example: "示例：\n" +
            "选号：1 \n" +
            "开奖：1个1 \n"
    },
}
const GameSetingSpecialSymbolic = {
    SA_NOT_SET: 0,
    ZHU: "猪",
    GOU: "狗",
    JI: "鸡",
    HOU: "猴",
    YANG: "羊",
    MA: "马",
    SHE: "蛇",
    LONG: "龙",
    TU: "兔",
    HU: "虎",
    NIU: "牛",
    SHU: "鼠",
    TAIL0: "0尾"
}

function getGameSetingSpecialSymbolicWithKey(key) {
    return [GameSetingSpecialSymbolic[key]]
}

function getGameMathKeyWithTitle(title, cpName) {
    "use strict";
    switch (cpName) {
        case "HF_LFSSC":
        case "HF_CQSSC":
        case "HF_TJSSC":
        case "HF_XJSSC":
        case "HF_JXSSC":
            {
                return SSC_GameMathKey[title]
            }
            break
        case "HF_LFPK10":
        case "HF_BJPK10":
            {
                return BJPK10_GameMathKey[title]
            }
            break
        case "MARK_SIX":
            {
                return MarkSix_GameMathKey[title]
            }
            break
            // case "X3D": {
            //     return D3_GameMathKey[title]
            // }
            //     break

        case "HF_LFD11":
        case "HF_GDD11":
        case "HF_AHD11":
        case "HF_JXD11":
        case "HF_SDD11":
        case "HF_SHD11":
            {
                return D11X5_GameMathKey[title]
            }
            break
        case "HF_CQKL10F":
        case "HF_TJKL10F":
        case "HF_GDKL10F":
            {
                return KL10F_GameMathKey[title]
            }
            break
        case "HF_JND28":
        case "HF_LF28":
        case "HF_SG28":
        case "HF_BJ28":
            {
                return PCDD_GameMathKey[title]
            }
            break
        case "HF_BJK3":
        case "HF_JLK3":
        case "HF_JSK3":
        case "HF_GXK3":
        case "HF_AHK3":
            {
                return K3_GameMathKey[title]
            }
            break
        case "X3D":
        case "HF_SHSSL":
        case "PL3":
            {
                return PL3_SSL_GameMathKey[title]
            }
            break
        case "HF_LFKLPK":
            {
                return HappyPoker_GameMathKey[title]
            }
            break
        case "HF_XYFT":
        case "HF_XYSM":
        {
            return XYFT_GameMathKey[title]
        }
            break
    }
}


function getGameMathExplainWithTitle(title, cpName) {
    "use strict";
    switch (cpName) {
        case "HF_LFSSC":
        case "HF_CQSSC":
        case "HF_TJSSC":
        case "HF_XJSSC":
        case "HF_JXSSC":
            {
                return SSC_GameMathExplain[title]
            }
            break
        case "HF_LFPK10":
        case "HF_BJPK10":
            {
                return BJPK10_GameMathExplain[title]
            }
            break
        case "MARK_SIX":
            {
                return MarkSix_GameMathExplain[title]
            }
            break

        case "HF_LFD11":
        case "HF_GDD11":
        case "HF_AHD11":
        case "HF_JXD11":
        case "HF_SDD11":
        case "HF_SHD11":
            {
                return D11X5_GameMathExplain[title]
            }
            break
        case "HF_CQKL10F":
        case "HF_TJKL10F":
        case "HF_GDKL10F":
            {
                return KL10F_GameMathExplain[title]
            }
            break
        case "HF_JND28":
        case "HF_LF28":
        case "HF_SG28":
        case "HF_BJ28":
            {
                return PCDD_GameMathExplain[title]
            }
            break
        case "HF_BJK3":
        case "HF_JLK3":
        case "HF_JSK3":
        case "HF_GXK3":
        case "HF_AHK3":
            {
                return K3_GameMathExplain[title]
            }
            break
        case "X3D":
        case "HF_SHSSL":
        case "PL3":
            {
                return PL3_SSL_GameMathExplain[title]
            }
            break
        case "HF_LFKLPK":
            {
                return HappyPoker_GameMathExplain[title]
            }
            break
    }
}
export {
    GameUniqueId,
    SSC_GameMathKey,
    BJPK10_GameMathKey,
    D11X5_GameMathKey,
    MarkSix_GameMathKey,
    D3_GameMathKey,
    K3_GameMathKey,
    getGameSetingSpecialSymbolicWithKey,
    getGameMathKeyWithTitle,
    getGameMathExplainWithTitle
}